---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FramingLengthRoundoff
source: html/40e85128-ae45-d1d6-8069-93abfa311bc2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FramingLengthRoundoff Property

"Structural Framing Length Roundoff"

## Syntax (C#)
```csharp
public static ForgeTypeId FramingLengthRoundoff { get; }
```